BCPH357/stm32n6_rppg/stm32_rppg/Appli/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_x-cube-ai.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "rk050hr18.h"
#include "stm32n6570_discovery_camera.h"
#include "stm32n6570_discovery_bus.h"
#include "camera_display.h"
#include "isp_api.h"          // ISP middleware
#include "isp_core.h"         // ISP core
#include "imx335_E27_isp_param_conf.h"  // ISP parameters
#include "imx335.h"           // IMX335 sensor driver
#include <stdio.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
#define ENABLE_CAMERA_PIPELINE 1


/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
CACHEAXI_HandleTypeDef hcacheaxi;

DCMIPP_HandleTypeDef hdcmipp;

I2C_HandleTypeDef hi2c1;

LTDC_HandleTypeDef hltdc;

RAMCFG_HandleTypeDef hramcfg_SRAM3;
RAMCFG_HandleTypeDef hramcfg_SRAM4;
RAMCFG_HandleTypeDef hramcfg_SRAM5;
RAMCFG_HandleTypeDef hramcfg_SRAM6;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */
// ISP handle from BSP driver
extern ISP_HandleTypeDef hcamera_isp;  // Defined in stm32n6570_discovery_camera.c

// IMX335 sensor object (defined here, not in BSP)
IMX335_Object_t IMX335Obj;

// ISP cached values (for Get functions)
static int32_t isp_gain = 0;
static int32_t isp_exposure = 0;

// Forward declarations
static int32_t IMX335_Probe(uint32_t Resolution, uint32_t PixelFormat);
static ISP_StatusTypeDef GetSensorInfoHelper(uint32_t Instance, ISP_SensorInfoTypeDef *SensorInfo);
static ISP_StatusTypeDef SetSensorGainHelper(uint32_t Instance, int32_t Gain);
static ISP_StatusTypeDef GetSensorGainHelper(uint32_t Instance, int32_t *Gain);
static ISP_StatusTypeDef SetSensorExposureHelper(uint32_t Instance, int32_t Exposure);
static ISP_StatusTypeDef GetSensorExposureHelper(uint32_t Instance, int32_t *Exposure);
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void MX_GPIO_Init(void);
static void MX_CACHEAXI_Init(void);
static void MX_RAMCFG_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_DCMIPP_App_Init(void);
static void MX_I2C1_App_Init(uint32_t timing);
static void MX_LTDC_Init(void);
static void MX_DCMIPP_Init(void);
static void SystemIsolation_Config(void);
void SystemClock_Config(void);
/* USER CODE BEGIN PFP */
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* Enable I-Cache (keep D-Cache off to avoid framebuffer artifacts) */
  SCB_EnableICache();

  /* HAL init */
  HAL_Init();
  SystemClock_Config();

  /* Peripherals */
  MX_GPIO_Init();
  MX_CACHEAXI_Init();
  MX_RAMCFG_Init();
  MX_USART1_UART_Init();

  printf("\r\n========================================\r\n");
  printf("  STM32N6 rPPG Camera Display Demo\r\n");
  printf("========================================\r\n");
  printf("[Init] Basic peripherals initialized\r\n");

  /* Initialize I2C1 first (may be needed for LCD controller configuration) */
  MX_I2C1_App_Init(0x30C0EDFF);  // Use same fixed timing as old version
  printf("[Init] I2C1 initialized\r\n");

  /* Initialize LTDC (display will show framebuffer later) */
  MX_LTDC_Init();
  printf("[Init] LTDC initialized\r\n");

  /* Initialize X-CUBE-AI (enables AXISRAM clocks including AXISRAM3 for framebuffer!) */
  MX_X_CUBE_AI_Init();
  printf("[Init] X-CUBE-AI initialized (AXISRAM clocks enabled)\r\n");

  /* Configure system isolation (RIF for NPU, DCMIPP, LTDC, and GPIO attributes) */
  SystemIsolation_Config();
  printf("[Init] System Isolation configured (RIF + GPIO attributes)\r\n");

  /* Initialize camera display (sets up LTDC layer and enables display) */
  CameraDisplay_Init();
  printf("[Init] Camera display initialized (LTDC layer enabled)\r\n");

  /* --------------------------------------------------------------
   * CAMERA PIPELINE INITIALIZATION (OFFICIAL ORDER)
   * -------------------------------------------------------------- */
#if ENABLE_CAMERA_PIPELINE
  printf("[Init] Starting camera pipeline initialization...\r\n");

  /* =============================================================
   * STEP 1: Initialize DCMIPP (FULL OFFICIAL SEQUENCE REQUIRED!)
   * ============================================================= */
  MX_DCMIPP_Init();     // <== 必須完整移植官方的版本
  printf("[Init] DCMIPP HAL initialized\r\n");

  /* =============================================================
   * STEP 2: Hardware reset for IMX335
   * ============================================================= */
  if (BSP_CAMERA_HwReset(0) != 0)
  {
    printf("[ERROR] Camera hardware reset failed\r\n");
    Error_Handler();
  }
  printf("[Init] Camera hardware reset completed\r\n");

  /* =============================================================
   * STEP 3: Probe & Initialize IMX335 Sensor
   * (Important: IMX335_Init() inside Probe WILL ENABLE STREAMING)
   * ============================================================= */
  if (IMX335_Probe(IMX335_R2592_1944, IMX335_RAW_RGGB10) != IMX335_OK)
  {
    printf("[ERROR] IMX335 sensor probe failed\r\n");
    Error_Handler();
  }
  printf("[Init] IMX335 sensor initialized (streaming ON inside init)\r\n");

  /* =============================================================
   * STEP 4: Initialize ISP (helpers + IQ table)
   * ============================================================= */
  ISP_AppliHelpersTypeDef appliHelpers;
  appliHelpers.GetSensorInfo     = GetSensorInfoHelper;
  appliHelpers.SetSensorGain     = SetSensorGainHelper;
  appliHelpers.GetSensorGain     = GetSensorGainHelper;
  appliHelpers.SetSensorExposure = SetSensorExposureHelper;
  appliHelpers.GetSensorExposure = GetSensorExposureHelper;
  printf("[ISP DEBUG] Helper ptrs: %p %p %p %p %p\r\n",
         appliHelpers.GetSensorInfo,
         appliHelpers.SetSensorGain,
         appliHelpers.GetSensorGain,
         appliHelpers.SetSensorExposure,
         appliHelpers.GetSensorExposure);

  printf("[DEBUG] Entering ISP_Init...\r\n");
  ISP_StatusTypeDef istat =
      ISP_Init(&hcamera_isp,
               &hdcmipp,
               0,
               &appliHelpers,
               ISP_IQParamCacheInit[0]);   // from imx335_E27_isp_param_conf.h

